class Wasteland:
    chat_id = 430930191
    greatwar_chat_id = -1001056860719
    tolyly_chat_id = -1001340142603

    ww_unicode = '☂️☣️♂✴️❇️☕️⚡️²➃⁴ãąɐæᴮčēǝⒺⒽıℑĸķłℳŇⓇßŤŧūṼⓏαἌβγεηΘιλΜνορΣτυᵡωәіөթღყシッツビプホむョⵓ噛影龍0123456789'
    raid_kms = {5, 9, 12, 16, 20, 24, 28, 32, 38, 46, 53, 54, 57, 63}
    raid_kms_tz = {24, 28, 32, 38, 53, 57, 63}

    take_kms = {11, 19, 23, 29, 34, 39, 45, 59, 56, 69, 74, 80}
    take_kms_tz = {23, 34, 56, 80}

    shop_category = (
        ('💈Товары из WW', 'Товары, которые выдадут тебе в Wasteland Wars', 'wwitem'),
        ('💎Товары из DeusAI', 'Товары, которые ты получишь прямо в этом боте', 'deusai'),
        ('⚗️Товары из бармена', 'Товары, которые ты получишь у бармена. Бармен, кстати, ещё не родился', 'barmen')
    )

    shop_category_by_slug = {
        'wwitem': ('💈Товары из WW', 'Товары, которые выдадут тебе в Wasteland Wars'),
        'deusai': ('💎Товары из DeusAI', 'Товары, которые ты получишь прямо в этом боте'),
        'barmen': ('⚗️Товары из бармена', 'Товары, которые ты получишь у бармена. Бармен, кстати, ещё не родился')
    }

    inventory_types = [
        ('REWARD', '🏆Награды'),
        ('PEOPLE', '🦾Части тела'),

        ('FOOD', 'Еда'),
        ('WEAPON', 'Оружие'),
        ('ARMOR', 'Броня'),

        ('OTHER', 'Прочее'),
        ('STUFF', 'Хлам'),
        ('RESOURCE', 'Ресурсы'),
    ]

    KEY_STAT_ICON_BY_NAME = {
        'hp': '❤️',
        'power': '💪',
        'accuracy': '🎯',
        'oratory': '🗣',
        'agility': '🤸🏽️'
    }
    KEY_STAT_BASE_CAP_BY_NAME = {
        'hp': 1550,
        'power': 1300,
        'accuracy': 1300,
        'oratory': 1200,
        'agility': 1200,
    }

    KEY_STATS = {
        'hp': '❤️Здоровье',
        'power': '💪Сила',
        'accuracy': '🎯Меткость',
        'oratory': '🗣Харизма',
        'agility': '🤸🏽️Ловкость',
    }

    COLOR_BY_KEY_STAT = {
        'hp': 'rgb(214, 14, 0)',
        'power': 'rgb(245, 139, 17)',
        'accuracy': 'rgb(2, 224, 6)',
        'oratory': 'rgb(2, 34, 179)',
        'agility': 'rgb(17, 242, 238)',
    }

    group_type_translate = {
        'gang': 'Банда',
        'goat': 'Козёл',
        'squad': 'Отряд',
        'vote': 'Опрос'
    }

    group_type_icon = {
        'gang': '🤘',
        'goat': '🐐',
        'squad': '🔰',
        'vote': '✍',
    }

    take_locations = {
        'Старая шахта': 11,
        '⚠️Пещера Ореола': 19,
        '🚽Сточная труба': 23,
        '⚙️Открытое убежище': 29,
        '🦇Бэт-пещера': 34,
        '🦆Перевал Уткина': 39,
        '🌁Высокий Хротгар': 45,
        '🛑Руины Гексагона': 50,
        '🔬Научный комплекс': 56,
        '⛩Храм Мудрости': 69,
        '👁‍🗨Черная Меза': 74,
        '🔥Огненные недра': 80
    }
    take_locations_km_by_shortname = {
        'Шахта': 11,
        'Пещера': 19,
        'Канализация': 23,
        'Убежище 95': 29,
        'Бэт-пещера': 34,
        'Перевал Уткина': 39,
        'Высокий Хротгар': 45,
        'Гексагон': 50,
        'Комплекс': 56,
        'Храм': 69,
        'Черная Меза': 74,
        'Огненные недра': 80
    }
    take_locations_by_km = {
        11: ('⛰ Старая шахта', 4),
        19: ('⚠️ Пещера Ореола', 1),
        23: ('🚽 Сточная труба', 4),
        29: ('⚙️ Открытое убежище', 6),
        34: ('🦇 Бэт-пещера', 6),
        39: ('🦆 Перевал Уткина', 6),
        45: ('🌁 Высокий Хротгар', 6),
        50: ('🛑 Руины Гексагона', 8),
        56: ('🔬 Научный комплекс', 8),
        69: ('⛩Храм Мудрости', 8),
        74: ('👁‍🗨 Черная Меза', 10),
        80: ('🔥Огненные недра', 10)
    }

    raid_locations = {
        'Старая фабрика': ('📦', 5),
        'Завод "Ядер-Кола"': ('🕳', 9),
        'Тюрьма': ('💊', 12),
        'Склады': ('🍗', 16),
        'Датацентр': ('🔹', 20),
        '🚷Госпиталь': ('❤️', 24),
        '🚷Завод "Электрон"': ('💡', 28),
        '🚷Офисное здание': ('💾', 32),
        '🚷Иридиевая шахта': ('🔩', 38),
        'Склад металла': ('🔗', 46),
        '🚷Радиостанция': ('🔗', 53),
        'Водохранилище': ('🥃', 54),
        '🚷Реактор': ('🔗', 57),
        '🚷Институт': ('🔸', 63)
    }
    raid_locations_by_km = {
        5: ('Старая фабрика', '📦'),
        9: ('Завод "Ядер-Кола"', '🕳'),
        12: ('Тюрьма', '💊'),
        16: ('Склады', '🍗'),
        20: ('Датацентр', '🔹'),
        24: ('Госпиталь', '❤️'),
        28: ('Завод "Электрон"', '💡'),
        32: ('Офисное здание', '💾'),
        38: ('Иридиевая шахта', '🔩'),
        46: ('Склад металла', '🔗'),
        53: ('Радиостанция', '🔗'),
        54: ('Водохранилище', '🥃'),
        57: ('Реактор', '🔗'),
        63: ('Институт', '🔸')
    }

    raid_kms_by_league = {
        '🥇Савант-лига': [20, 38, 54, 57, 63],
        '🥈Вторая лига': [16, 28, 46, 53],
        '🥉Детская лига': [5, 9, 12, 24, 32],
    }

    raid_kms_price = {
        5: 4.2,
        9: 8.4,
        12: 11.2,
        16: 14,
        20: 18.2,
        24: 22.4,
        28: 25.2,
        32: 29.4,
        38: 35,
        46: 42,
        53: 49,
        54: 50.4,
        57: 53.2,
        63: 53.8
    }
    raid_kms_weight = {
        5: 15,
        9: 15,
        12: 15,
        16: 15,
        20: 15,
        24: 20,
        28: 20,
        32: 20,
        38: 20,
        46: 15,
        53: 20,
        54: 15,
        57: 20,
        63: 20
    }

    # ordered fractions
    ordered_fractions = [
        r'⚛️Республика',
        r'🔪Головорезы',
        r'⚙️Убежище 4',
        r'💣Мегатонна',
        r'🔰Конкорд',
        r'⚙️Убежище 11'
    ]
    # fractions
    fractions = {
        'v6': '⚛️Республика',
        'glz': '🔪Головорезы',
        'v4': '⚙️Убежище 4',
        'mt': '💣Мегатонна',
        'v11': '⚙️Убежище 11',
        'kk': '🔰Конкорд'
    }
    fractions_by_name = {
        '⚙️Убежище 6': 'v6',
        '⚛️Республика': 'v6',
        '🔪Головорезы': 'glz',
        '⚙️Убежище 4': 'v4',
        '💣Мегатонна': 'mt',
        '⚙️Убежище 11': 'v11',
        '🔰Конкорд': 'kk'
    }
    fractions_by_icon = {
        '⚛️': 'v6',
        '🔪': 'glz',
        '⚙️': 'v4',
        '💣': 'mt',
        # '⚙️': 'v11',
        '🔰': 'kk'
    }
